
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/18802663515)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_pages_project.homepage


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_pages_project.homepage will be updated in-place
  ~ resource "cloudflare_pages_project" "homepage" {
      ~ canonical_deployment = {
          ~ aliases            = [
              - "https://clov3r.cc",
              - "https://www.clov3r.cc",
            ] -> (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-10-25T06:56:49Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  + commit_hash    = (known after apply)
                  + commit_message = (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "954348d9-13d3-4816-8890-335b129aaee8" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-10-25T06:56:52Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-10-25T06:56:52Z" -> (known after apply)
          ~ project_id         = "f9e9ebc0-fd49-433a-9d6c-ecf93d800066" -> (known after apply)
          ~ project_name       = "my-home" -> (known after apply)
          ~ short_id           = "954348d9" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-10-25T06:56:49Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-10-25T06:56:52Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://954348d9.my-home.pages.dev" -> (known after apply)
        } -> (known after apply)
      ~ created_on           = "2025-10-25T06:51:55Z" -> (known after apply)
      ~ deployment_configs   = {
          ~ preview    = {
              - compatibility_date  = "2025-10-25" -> null
              - compatibility_flags = [] -> null
            }
          ~ production = {
              - compatibility_flags = [] -> null
                # (1 unchanged attribute hidden)
            }
        }
      ~ domains              = [
          - "my-home.pages.dev",
          - "clov3r.cc",
          - "www.clov3r.cc",
        ] -> (known after apply)
        id                   = "my-home"
      ~ latest_deployment    = {
          ~ aliases            = [
              - "https://clov3r.cc",
              - "https://www.clov3r.cc",
            ] -> (known after apply)
          ~ build_config       = {
              + build_caching       = (known after apply)
              + build_command       = (known after apply)
              + destination_dir     = (known after apply)
              + root_dir            = (known after apply)
              + web_analytics_tag   = (known after apply)
              + web_analytics_token = (sensitive value)
            } -> (known after apply)
          ~ created_on         = "2025-10-25T06:56:49Z" -> (known after apply)
          ~ deployment_trigger = {
              ~ metadata = {
                  ~ branch         = "main" -> (known after apply)
                  + commit_hash    = (known after apply)
                  + commit_message = (known after apply)
                } -> (known after apply)
              ~ type     = "ad_hoc" -> (known after apply)
            } -> (known after apply)
          ~ env_vars           = {} -> (known after apply)
          ~ environment        = "production" -> (known after apply)
          ~ id                 = "954348d9-13d3-4816-8890-335b129aaee8" -> (known after apply)
          ~ is_skipped         = false -> (known after apply)
          ~ latest_stage       = {
              ~ ended_on   = "2025-10-25T06:56:52Z" -> (known after apply)
              ~ name       = "deploy" -> (known after apply)
              + started_on = (known after apply)
              ~ status     = "success" -> (known after apply)
            } -> (known after apply)
          ~ modified_on        = "2025-10-25T06:56:52Z" -> (known after apply)
          ~ project_id         = "f9e9ebc0-fd49-433a-9d6c-ecf93d800066" -> (known after apply)
          ~ project_name       = "my-home" -> (known after apply)
          ~ short_id           = "954348d9" -> (known after apply)
          + source             = (known after apply)
          ~ stages             = [
              - {
                  - name       = "queued" -> null
                  - started_on = "2025-10-25T06:56:49Z" -> null
                  - status     = "active" -> null
                },
              - {
                  - name   = "initialize" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "clone_repo" -> null
                  - status = "idle" -> null
                },
              - {
                  - name   = "build" -> null
                  - status = "idle" -> null
                },
              - {
                  - ended_on = "2025-10-25T06:56:52Z" -> null
                  - name     = "deploy" -> null
                  - status   = "success" -> null
                },
            ] -> (known after apply)
          ~ url                = "https://954348d9.my-home.pages.dev" -> (known after apply)
        } -> (known after apply)
        name                 = "my-home"
      ~ subdomain            = "my-home.pages.dev" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":119,"Program":"tfcmt","SHA1":"c7bba77b440ad57e121d4eb94903822d39b1ca9b","Vars":{},"WorkflowName":"Terraform CI"} -->